app/controllers/songs_controller.rb

SELECT "artists".* FROM "artists"
---
  def new
    if params[:artist_id] && !Artist.exists?(params[:artist_id])

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1234]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1234]]
---
  def edit
    @nested = false
    if params[:artist_id]
      #if 'artist_id' is present, try to find artist...
      artist = Artist.find_by(id: params[:artist_id])
      if artist.nil?
        #...if you can't find them
        redirect_to artists_path, alert: "Artist not found."
      else
        #...and find the song...
        @song = artist.songs.find_by(id: params[:id])

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 2]]
---
  def update
    @song = Song.find(params[:id])